## Restaurant Sales Data

In [4]:
import numpy as np
import pandas as pd

import warnings
warnings.filterwarnings('ignore')

In [19]:
# import data
data = pd.read_csv('DS1_C4_S3_SalesData_Practice.csv')
data

   Month Store  Sales       State
0    Jan     A  21080      Alaska
1    Jan     B  32985       Texas
2    Jan     C  22369  California
3    Jan     D  45710     Montana
4    Jan     E  27113  New Mexico
5    Feb     A  27573      Alaska
6    Feb     B  31244       Texas
7    Feb     C  48624  California
8    Feb     D  31768     Montana
9    Feb     E  23851  New Mexico
10   Mar     A  33274      Alaska
11   Mar     B  27215       Texas
12   Mar     C  23475  California
13   Mar     D  21357     Montana
14   Mar     E  22130  New Mexico
15   Apr     A  26073      Alaska
16   Apr     B  45919       Texas
17   Apr     C  30279  California
18   Apr     D  21394     Montana
19   Apr     E  25184  New Mexico
20   May     A  37649      Alaska
21   May     B  44597       Texas
22   May     C  29697  California
23   May     D  28943     Montana
24   May     E  22541  New Mexico
25   Jun     A  28500      Alaska
26   Jun     B  32896       Texas
27   Jun     C  30200  California
28   Jun     D  37098     Montana
29   Jun     E  41098  New Mexico

In [20]:
# Task 1

arrange = data.sort_values('Sales')
print("Sorted sales data in ascending order is:")
arrange

Sorted sales data in ascending order is:

   Month Store  Sales       State
0    Jan     A  21080      Alaska
13   Mar     D  21357     Montana
18   Apr     D  21394     Montana
14   Mar     E  22130  New Mexico
2    Jan     C  22369  California
24   May     E  22541  New Mexico
12   Mar     C  23475  California
9    Feb     E  23851  New Mexico
19   Apr     E  25184  New Mexico
15   Apr     A  26073      Alaska
4    Jan     E  27113  New Mexico
11   Mar     B  27215       Texas
5    Feb     A  27573      Alaska
25   Jun     A  28500      Alaska
23   May     D  28943     Montana
22   May     C  29697  California
27   Jun     C  30200  California
17   Apr     C  30279  California
6    Feb     B  31244       Texas
8    Feb     D  31768     Montana
26   Jun     B  32896       Texas
1    Jan     B  32985       Texas
10   Mar     A  33274      Alaska
28   Jun     D  37098     Montana
20   May     A  37649      Alaska
29   Jun     E  41098  New Mexico
21   May     B  44597       Texas
3    Jan     D  45710     Montana
16   Apr     B  45919       Texas
7    Feb     C  48624  California

In [21]:
# Task 2

sale = data[data.Sales >= 45000]
print("Sales data greater than or equal to 45000 is:")
sale

Sales data greater than or equal to 45000 is:

   Month Store  Sales       State
3    Jan     D  45710     Montana
7    Feb     C  48624  California
16   Apr     B  45919       Texas

In [22]:
# Task 3

# Data of California

cali = data[data.State == 'California']
print("Sales Data for California in ascending order is:")
cali.sort_values('Sales')

Sales Data for California in ascending order is:

   Month Store  Sales       State
2    Jan     C  22369  California
12   Mar     C  23475  California
22   May     C  29697  California
27   Jun     C  30200  California
17   Apr     C  30279  California
7    Feb     C  48624  California

In [23]:
# Data of Texas

TX = data[data.State == 'Texas']
print("Sales data for Texas in ascending order is:")
TX.sort_values('Sales')

Sales data for Texas in ascending order is:

   Month Store  Sales  State
11   Mar     B  27215  Texas
6    Feb     B  31244  Texas
26   Jun     B  32896  Texas
1    Jan     B  32985  Texas
21   May     B  44597  Texas
16   Apr     B  45919  Texas

In [24]:
# Data of Montana

Montana = data[data.State == 'Montana']
print("Sales data for Montana in ascending order is:")
Montana.sort_values('Sales')

Sales data for Montana in ascending order is:

   Month Store  Sales    State
13   Mar     D  21357  Montana
18   Apr     D  21394  Montana
23   May     D  28943  Montana
8    Feb     D  31768  Montana
28   Jun     D  37098  Montana
3    Jan     D  45710  Montana

In [30]:
# Task 4

TX_sales = TX['Sales'].sum()
cali_sales = cali['Sales'].sum()
Montana_sales = Montana['Sales'].sum()
print("Total sales in the state of Texas is:", TX_sales)
print("Total sales in the state of California is:", cali_sales)
print("Total sales in the state of Montana is:", Montana_sales)

Total sales in the state of Texas is: 214856
Total sales in the state of California is: 184644
Total sales in the state of Montana is: 186270

In [63]:
# Task 5

monthly_sales = cali.groupby('Month')['Sales'].sum()
highest_month = monthly_sales.idxmax()
lowest_month = monthly_sales.idxmin()

print('Month with the highest sales is:', highest_month)
print('Month with the lowest sales is:', lowest_month)

Month with the highest sales is: Feb
Month with the lowest sales is: Jan

In [68]:
# Task 6

data_2 = {'State': ['Alaska', 'Texas', 'California', 'Montana', 'New Mexico'], 'Sales': [174149, 214856, 184644, 186270, 161917]}
new_data = pd.DataFrame(data_2)
new_data

        State   Sales
0      Alaska  174149
1       Texas  214856
2  California  184644
3     Montana  186270
4  New Mexico  161917

In [78]:
# Task 7

total_sales = new_data.sort_values('Sales')

# Exporting as .csv file

total_sales.to_csv('total_sales.csv', index=False)
total_sales

        State   Sales
4  New Mexico  161917
0      Alaska  174149
2  California  184644
3     Montana  186270
1       Texas  214856